; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	thermograph0 - mode
	image2 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation14 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation3 - direction
	Star12 - direction
	Star13 - direction
	Star6 - direction
	Star4 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation14)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star12)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star12)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star13)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
	(supports instrument6 spectrograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star6)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation14)
)
(:goal (and
	(pointing satellite2 GroundStation14)
	(pointing satellite3 Star4)
	(have_image Star15 image2)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 image2)
	(have_image Planet18 image2)
))

)

; plan
1. (turn_to satellite3 star4 groundstation14)
   deleted: (pointing satellite3 groundstation14)
   added: (pointing satellite3 star4)
   goals met: 2 of 6
2. (turn_to satellite0 star12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star12)
   goals met: 2 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
4. (calibrate satellite0 instrument1 star12)
   added: (calibrated instrument1)
   goals met: 2 of 6
5. (turn_to satellite0 planet18 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet18)
   goals met: 2 of 6
6. (take_image satellite0 planet18 instrument1 image2)
   added: (have_image planet18 image2)
   goals met: 3 of 6
7. (turn_to satellite0 phenomenon17 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 6
8. (take_image satellite0 phenomenon17 instrument1 image2)
   added: (have_image phenomenon17 image2)
   goals met: 4 of 6
9. (turn_to satellite0 star15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star15)
   goals met: 4 of 6
10. (take_image satellite0 star15 instrument1 image2)
   added: (have_image star15 image2)
   goals met: 5 of 6
11. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 5 of 6
12. (take_image satellite0 star16 instrument1 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 6 of 6
